// 1.usestate არის ჰუკი რომელიც გამოიყენება ფუნქციურ კომპონენტში 
// 2.useeffect არის ჰუკი რომელიც გვერდითა ეფექტებს რთავს ფუნქციონალურად
// 3.let var და const ორივე ცვლადია მარამ var მიეკუთვნება მხოლოდ იმ ფუნქციას რომელშიც ის დეკლარირებულია ხოლო const - ის მნიშვნელობა არ უნდა გადაინიშნოს მისი მინიჭების შემდგომ
// 4.DOM წარმოადგენს დოკუმენტის სტრუქტურას სადაც თითოეული ელემენტი შეესაბამება დოკუმენტის ნაწილს როგორიცაა ელემენტები ატრიბუტები და ტექსტი
// 5.props  არის მექანიზმი რომელიც ერთ მონაცემს გადასცემს მეორეს